# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

num = int(input('Введите шестизначный номер билета: '))
sum1 = num // 10 ** 5 + num % 10 ** 5 // 10 ** 4 + num % 10 ** 4 // 10 ** 3
sum2 = num % 10 + num % 100 // 10 + num % 1000 // 100
if sum1 == sum2:
    print('Этот билет счастливый!')
else:
    print('Этот билет несчастливый.')

# Второй способ решения

Num =  input('Введите шестизначный номер билета: ')
if int(Num[0]) + int(Num[1]) + int(Num[2]) == int(Num[3]) + int(Num[4]) + int(Num[5]):
    print('Этот билет счастливый!')
else:
    print('Этот билет несчастливый.')